Catalogs/ИА_БПТочкиМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПТочкиМаршрута</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_БПКартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыАдресацииЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПВариантыДней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммнаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияИстинно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияЛожно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадачВложенногоБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьАвторуНаПроверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеЛинии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСобытияТочекБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПВариантыОбработчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыВложенногоБП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСпособыЗаполненияДопРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыводимыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьПриСозданииЗадачи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ИА_БПТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПТипыТочекМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйБизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПСобытияТочекБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПСобытияТочекБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Условие_ПроверкаУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие_ПриВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеНаименования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСодержания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаОтветственного</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПВариантыОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПВариантыОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интерактивно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонструкторУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммныйОбработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_БПТочкиМаршрута/Ext/ManagerModule.bsl
//_____________________________________________________________
// ИНТЕРФЕЙС

Функция ПолучитьВходящиеТочки(Точка) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПТочкиМаршрутаИсходящиеЛинии.Ссылка КАК Точка
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута.ИсходящиеЛинии КАК ИА_БПТочкиМаршрутаИсходящиеЛинии
    |ГДЕ
    |   ИА_БПТочкиМаршрутаИсходящиеЛинии.Адрес = &Адрес
    |   И НЕ ИА_БПТочкиМаршрутаИсходящиеЛинии.Ссылка.ПометкаУдаления";
    Запрос.УстановитьПараметр("Адрес", Точка);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Точка");
    Возврат Результат
КонецФункции

Функция ПолучитьИсходящиеТочки(Точка, Вариант = Неопределено) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПТочкиМаршрутаИсходящиеЛинии.Адрес
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута.ИсходящиеЛинии КАК ИА_БПТочкиМаршрутаИсходящиеЛинии
    |ГДЕ
    |   ИА_БПТочкиМаршрутаИсходящиеЛинии.Ссылка = &Ссылка
    |   И НЕ ИА_БПТочкиМаршрутаИсходящиеЛинии.Адрес.ПометкаУдаления
    |   И (&Вариант_НО
    |           ИЛИ ИА_БПТочкиМаршрутаИсходящиеЛинии.Вариант = &Вариант)";
    Запрос.УстановитьПараметр("Ссылка", Точка);
    Запрос.УстановитьПараметр("Вариант_НО", НЕ ЗначениеЗаполнено(Вариант));
    Запрос.УстановитьПараметр("Вариант",    Вариант);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Адрес");
    Возврат Результат;
КонецФункции

Функция ВТочкеТребуетсяВыборВарианта(Точка) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Точка = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    Результат = Точка.Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие;
    Возврат Результат;
КонецФункции

Функция ПолучитьМассивСобытий(ТипТочки) Экспорт
    Мен = Перечисления.ИА_БПТипыТочекМаршрута;
    МенСобытий  = Перечисления.ИА_БПСобытияТочекБП;
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТипТочки = мен.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    Результат = Новый Массив;
    
	Если ТипТочки = мен.Условие Тогда
        Результат.Добавить(МенСобытий.Условие_ПроверкаУсловия);
        Результат.Добавить(МенСобытий.ФормированиеНаименования);
        Результат.Добавить(МенСобытий.ФормированиеСодержания);
		Результат.Добавить(МенСобытий.УстановкаОтветственного); 
    ИначеЕсли ТипТочки = мен.Действие Тогда
        Результат.Добавить(МенСобытий.Действие_ПриВыполнении);
        Результат.Добавить(МенСобытий.ФормированиеНаименования);
        Результат.Добавить(МенСобытий.ФормированиеСодержания);
        Результат.Добавить(МенСобытий.УстановкаОтветственного); 
    ИначеЕсли ТипТочки = мен.ВложенныйБизнесПроцесс Тогда
        Результат.Добавить(МенСобытий.ФормированиеНаименования);
        Результат.Добавить(МенСобытий.ФормированиеСодержания);
        Результат.Добавить(МенСобытий.УстановкаОтветственного); 
    КонецЕсли; 
    Возврат Результат;
КонецФункции

Процедура ЗаполнитьЗначенияОбработчиковПоУмолчаниюВТочке(Точка) Экспорт
    //{ Заполним связанную информацию по "Событиям"
    Для каждого СтрокаТЧ Из Точка.Обработчики Цикл
        Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Обработчик) Тогда
            Если Точка.Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие
                И СтрокаТЧ.Событие = Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия
                Тогда
                СтрокаТЧ.Обработчик = Перечисления.ИА_БПВариантыОбработчиков.Интерактивно;
            Иначе
                СтрокаТЧ.Обработчик = Перечисления.ИА_БПВариантыОбработчиков.Нет;
            КонецЕсли; 
        КонецЕсли; 	
    КонецЦикла; 
КонецПроцедуры

//_____________________________________________________________
